// ///////////////////////////////////////Задача 19////////////////////////////////////////////////////////////
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.///
// ///////////////////////////////////////14212 -> нет/////////////////////////////////////////////////////////
// ///////////////////////////////////////12821 -> да//////////////////////////////////////////////////////////
// ///////////////////////////////////////23432 -> да//////////////////////////////////////////////////////////

//Решение без индексов и массивов:

/* Console.Write("Введите число: "); 
int number = Convert.ToInt32(Console.ReadLine());
if(number > 100000 || number < 9999)
{
    Console.Write($"Число {number} не является пятизначным");
    return;
}

int temp = number;
int reverseNumber = 0;
int digit = 0;
while(number >= 1)
{
    digit = number % 10;
    reverseNumber = reverseNumber * 10 + digit;
    number = number / 10;
}

if (temp == reverseNumber)
{
    Console.WriteLine("число является палиндромом");
}
else
{
    Console.WriteLine("число не является палиндромом");
}
 */

//Решение с индексами:

/* Console.Write("Введите число: ");
string number = Console.ReadLine();
int length = number.Length;
if (length != 5)
{
    Console.Write($"Число {number} не является пятизначным");
    return;
}
if (number[0] == number[4] && number[1] == number[3])
{
    Console.WriteLine("число является палиндромом");
}
else
{
    Console.WriteLine("число не является палиндромом");
} */

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////Задача 21///////////////////////////////////////////////////////////
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/* Console.WriteLine("Введите координаты первой точки в трехмерном пространстве:");
int xA = Convert.ToInt32(Console.ReadLine());
int yA = Convert.ToInt32(Console.ReadLine());
int zA = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите координаты второй точки в трехмерном пространстве:");
int xB = Convert.ToInt32(Console.ReadLine());
int yB = Convert.ToInt32(Console.ReadLine());
int zB = Convert.ToInt32(Console.ReadLine());

double distance = Math.Round(Math.Sqrt(Math.Pow(xA - xB, 2) + Math.Pow(yA - yB, 2) + Math.Pow(zA - zB, 2)));

Console.WriteLine("");
Console.WriteLine("Расстояние между заданными точками " + distance); */


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////Задача 23///////////////////////////////////////////////////////////
// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N./////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/* Console.Write("Веддите число N: ");
int N = Convert.ToInt32(Console.ReadLine());

for (int i = 1; i <= N; i++)
{
    Console.WriteLine($"Куб числа {i} равен {Math.Pow(i, 3)}");
} */