////////////////////////////////////////////////////////////////////Задача 34:////////////////////////////////////////////////////////////////////////////////
//////Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.///////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/* Console.Write("Введите размер массива: ");
int arrayLength = Convert.ToInt32(Console.ReadLine());

int[] array = new int[arrayLength];
int count = 0;
for (int i = 0; i < array.Length; i++)
{
    array[i] = new Random().Next(100, 999);
    if (array[i] % 2 == 0)
    {
        count++;
    }
}

Console.WriteLine($"Количество чётных чисел в массиве [{String.Join("; ", array)}] равно: {count}"); */

////////////////////////////////////////////////////////////////////Задача 36:////////////////////////////////////////////////////////////////////////////////
/////////////////////Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/* Console.Write("Введите размер массива: ");
int arrayLength = Convert.ToInt32(Console.ReadLine());

int[] array = new int[arrayLength];
int resultNumber = 0;
for (int index = 0; index < array.Length; index++)
{
    array[index] = new Random().Next(0, 10);
    if (index % 2 != 0)    
    //if (index % 2 == 0) - если мы имеем ввиду, что "элементы на нечетных позициях", это array[0] + array [2] + array [4], и т.д., ибо визуально кажется что так будет правильно, 
    //если взглянуть на результат. Если мы делаем программу не для программиста, а для обывателя, я бы оставил так. Но если следовать условию задачи, так как я его понял, 
    //то незакомментированный вариант, конечно.
    {
        resultNumber += array[index];
    }
}

Console.WriteLine($"Сумма чисел на нечетных позициях в массиве [{String.Join("; ", array)}] равна: {resultNumber}"); */

