///////////////////////////////////////////////////////////////////Задача 41:////////////////////////////////////////////////////////////////////////////////
//////////////////////////////Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Console.Write("Введите число М: ");
int mNumber = Convert.ToInt32(Console.ReadLine());

int[] array = new int[mNumber];
int countNumbers = 0;
for (int i = 0; i < mNumber; i++)
{
    Console.Write($"Введите {i + 1}-е число: ");
    array[i] = Convert.ToInt32(Console.ReadLine());
    if (array[i] > 0) countNumbers ++;
}

Console.WriteLine($"Среди чисел [{String.Join("; ", array)}] вы ввели {countNumbers} положительных.");